Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm048.h
extern volatile __CCP9STATbits_t CCP9STATbits __asm__ ("CCP9STAT") __attribute__((section("sfrs"), address(0xBF800930)));
extern volatile uint32_t        CCP9STATCLR __attribute__((section("sfrs"),address(0xBF800934)));
extern volatile uint32_t        CCP9STATSET __attribute__((section("sfrs"),address(0xBF800938)));
extern volatile uint32_t        CCP9STATINV __attribute__((section("sfrs"),address(0xBF80093C)));
#define CCP9TMR CCP9TMR
extern volatile uint32_t   CCP9TMR __attribute__((section("sfrs"), address(0xBF800940)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP9TMRbits_t;
extern volatile __CCP9TMRbits_t CCP9TMRbits __asm__ ("CCP9TMR") __attribute__((section("sfrs"), address(0xBF800940)));
extern volatile uint32_t        CCP9TMRCLR __attribute__((section("sfrs"),address(0xBF800944)));
extern volatile uint32_t        CCP9TMRSET __attribute__((section("sfrs"),address(0xBF800948)));
extern volatile uint32_t        CCP9TMRINV __attribute__((section("sfrs"),address(0xBF80094C)));
#define CCP9PR CCP9PR
extern volatile uint32_t   CCP9PR __attribute__((section("sfrs"), address(0xBF800950)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP9PRbits_t;
extern volatile __CCP9PRbits_t CCP9PRbits __asm__ ("CCP9PR") __attribute__((section("sfrs"), address(0xBF800950)));
extern volatile uint32_t        CCP9PRCLR __attribute__((section("sfrs"),address(0xBF800954)));
extern volatile uint32_t        CCP9PRSET __attribute__((section("sfrs"),address(0xBF800958)));
extern volatile uint32_t        CCP9PRINV __attribute__((section("sfrs"),address(0xBF80095C)));
#define CCP9RA CCP9RA
extern volatile uint32_t   CCP9RA __attribute__((section("sfrs"), address(0xBF800960)));
typedef struct {
  uint32_t CMPA:16;
} __CCP9RAbits_t;
extern volatile __CCP9RAbits_t CCP9RAbits __asm__ ("CCP9RA") __attribute__((section("sfrs"), address(0xBF800960)));
extern volatile uint32_t        CCP9RACLR __attribute__((section("sfrs"),address(0xBF800964)));
extern volatile uint32_t        CCP9RASET __attribute__((section("sfrs"),address(0xBF800968)));
extern volatile uint32_t        CCP9RAINV __attribute__((section("sfrs"),address(0xBF80096C)));
#define CCP9RB CCP9RB
extern volatile uint32_t   CCP9RB __attribute__((section("sfrs"), address(0xBF800970)));
typedef struct {
  uint32_t CMPB:16;
} __CCP9RBbits_t;
extern volatile __CCP9RBbits_t CCP9RBbits __asm__ ("CCP9RB") __attribute__((section("sfrs"), address(0xBF800970)));
extern volatile uint32_t        CCP9RBCLR __attribute__((section("sfrs"),address(0xBF800974)));
extern volatile uint32_t        CCP9RBSET __attribute__((section("sfrs"),address(0xBF800978)));
extern volatile uint32_t        CCP9RBINV __attribute__((section("sfrs"),address(0xBF80097C)));
#define CCP9BUF CCP9BUF
extern volatile uint32_t   CCP9BUF __attribute__((section("sfrs"), address(0xBF800980)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP9BUFbits_t;
extern volatile __CCP9BUFbits_t CCP9BUFbits __asm__ ("CCP9BUF") __attribute__((section("sfrs"), address(0xBF800980)));
extern volatile uint32_t        CCP9BUFCLR __attribute__((section("sfrs"),address(0xBF800984)));
extern volatile uint32_t        CCP9BUFSET __attribute__((section("sfrs"),address(0xBF800988)));
extern volatile uint32_t        CCP9BUFINV __attribute__((section("sfrs"),address(0xBF80098C)));
#define I2C1CON I2C1CON
extern volatile uint32_t   I2C1CON __attribute__((section("sfrs"), address(0xBF801500)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :2;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C1CONbits_t;
extern volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON") __attribute__((section("sfrs"), address(0xBF801500)));
extern volatile uint32_t        I2C1CONCLR __attribute__((section("sfrs"),address(0xBF801504)));
extern volatile uint32_t        I2C1CONSET __attribute__((section("sfrs"),address(0xBF801508)));
extern volatile uint32_t        I2C1CONINV __attribute__((section("sfrs"),address(0xBF80150C)));
#define I2C1STAT I2C1STAT
extern volatile uint32_t   I2C1STAT __attribute__((section("sfrs"), address(0xBF801510)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C1STATbits_t;
extern volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT") __attribute__((section("sfrs"), address(0xBF801510)));
extern volatile uint32_t        I2C1STATCLR __attribute__((section("sfrs"),address(0xBF801514)));
extern volatile uint32_t        I2C1STATSET __attribute__((section("sfrs"),address(0xBF801518)));
extern volatile uint32_t        I2C1STATINV __attribute__((section("sfrs"),address(0xBF80151C)));
#define I2C1ADD I2C1ADD
extern volatile uint32_t   I2C1ADD __attribute__((section("sfrs"), address(0xBF801520)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C1ADDbits_t;
extern volatile __I2C1ADDbits_t I2C1ADDbits __asm__ ("I2C1ADD") __attribute__((section("sfrs"), address(0xBF801520)));
extern volatile uint32_t        I2C1ADDCLR __attribute__((section("sfrs"),address(0xBF801524)));
extern volatile uint32_t        I2C1ADDSET __attribute__((section("sfrs"),address(0xBF801528)));
extern volatile uint32_t        I2C1ADDINV __attribute__((section("sfrs"),address(0xBF80152C)));
#define I2C1MSK I2C1MSK
extern volatile uint32_t   I2C1MSK __attribute__((section("sfrs"), address(0xBF801530)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C1MSKbits_t;
