Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm048.h
extern volatile __LATDbits_t LATDbits __asm__ ("LATD") __attribute__((section("sfrs"), address(0xBF802EE0)));
extern volatile uint32_t        LATDCLR __attribute__((section("sfrs"),address(0xBF802EE4)));
extern volatile uint32_t        LATDSET __attribute__((section("sfrs"),address(0xBF802EE8)));
extern volatile uint32_t        LATDINV __attribute__((section("sfrs"),address(0xBF802EEC)));
#define ODCD ODCD
extern volatile uint32_t   ODCD __attribute__((section("sfrs"), address(0xBF802EF0)));
typedef union {
  struct {
    uint32_t ODCD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCDbits_t;
extern volatile __ODCDbits_t ODCDbits __asm__ ("ODCD") __attribute__((section("sfrs"), address(0xBF802EF0)));
extern volatile uint32_t        ODCDCLR __attribute__((section("sfrs"),address(0xBF802EF4)));
extern volatile uint32_t        ODCDSET __attribute__((section("sfrs"),address(0xBF802EF8)));
extern volatile uint32_t        ODCDINV __attribute__((section("sfrs"),address(0xBF802EFC)));
#define CNPUD CNPUD
extern volatile uint32_t   CNPUD __attribute__((section("sfrs"), address(0xBF802F00)));
typedef union {
  struct {
    uint32_t CNPUD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUDbits_t;
extern volatile __CNPUDbits_t CNPUDbits __asm__ ("CNPUD") __attribute__((section("sfrs"), address(0xBF802F00)));
extern volatile uint32_t        CNPUDCLR __attribute__((section("sfrs"),address(0xBF802F04)));
extern volatile uint32_t        CNPUDSET __attribute__((section("sfrs"),address(0xBF802F08)));
extern volatile uint32_t        CNPUDINV __attribute__((section("sfrs"),address(0xBF802F0C)));
#define CNPDD CNPDD
extern volatile uint32_t   CNPDD __attribute__((section("sfrs"), address(0xBF802F10)));
typedef union {
  struct {
    uint32_t CNPDD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDDbits_t;
extern volatile __CNPDDbits_t CNPDDbits __asm__ ("CNPDD") __attribute__((section("sfrs"), address(0xBF802F10)));
extern volatile uint32_t        CNPDDCLR __attribute__((section("sfrs"),address(0xBF802F14)));
extern volatile uint32_t        CNPDDSET __attribute__((section("sfrs"),address(0xBF802F18)));
extern volatile uint32_t        CNPDDINV __attribute__((section("sfrs"),address(0xBF802F1C)));
#define CNCOND CNCOND
extern volatile uint32_t   CNCOND __attribute__((section("sfrs"), address(0xBF802F20)));
typedef union {
  struct {
    uint32_t :10;
    uint32_t PORT32:1;
    uint32_t CNSTYLE:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONDbits_t;
extern volatile __CNCONDbits_t CNCONDbits __asm__ ("CNCOND") __attribute__((section("sfrs"), address(0xBF802F20)));
extern volatile uint32_t        CNCONDCLR __attribute__((section("sfrs"),address(0xBF802F24)));
extern volatile uint32_t        CNCONDSET __attribute__((section("sfrs"),address(0xBF802F28)));
extern volatile uint32_t        CNCONDINV __attribute__((section("sfrs"),address(0xBF802F2C)));
#define CNEN0D CNEN0D
extern volatile uint32_t   CNEN0D __attribute__((section("sfrs"), address(0xBF802F30)));
typedef union {
  struct {
    uint32_t CNIE0D0:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN0Dbits_t;
extern volatile __CNEN0Dbits_t CNEN0Dbits __asm__ ("CNEN0D") __attribute__((section("sfrs"), address(0xBF802F30)));
extern volatile uint32_t        CNEN0DCLR __attribute__((section("sfrs"),address(0xBF802F34)));
extern volatile uint32_t        CNEN0DSET __attribute__((section("sfrs"),address(0xBF802F38)));
extern volatile uint32_t        CNEN0DINV __attribute__((section("sfrs"),address(0xBF802F3C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF802F40)));
typedef union {
  struct {
    uint32_t CNSTATD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF802F40)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF802F44)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF802F48)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF802F4C)));
#define CNEN1D CNEN1D
extern volatile uint32_t   CNEN1D __attribute__((section("sfrs"), address(0xBF802F50)));
typedef union {
  struct {
    uint32_t CNIE1D0:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN1Dbits_t;
extern volatile __CNEN1Dbits_t CNEN1Dbits __asm__ ("CNEN1D") __attribute__((section("sfrs"), address(0xBF802F50)));
extern volatile uint32_t        CNEN1DCLR __attribute__((section("sfrs"),address(0xBF802F54)));
extern volatile uint32_t        CNEN1DSET __attribute__((section("sfrs"),address(0xBF802F58)));
extern volatile uint32_t        CNEN1DINV __attribute__((section("sfrs"),address(0xBF802F5C)));
#define CNFD CNFD
extern volatile uint32_t   CNFD __attribute__((section("sfrs"), address(0xBF802F60)));
typedef union {
  struct {
    uint32_t CNFD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNFDbits_t;
extern volatile __CNFDbits_t CNFDbits __asm__ ("CNFD") __attribute__((section("sfrs"), address(0xBF802F60)));
extern volatile uint32_t        CNFDCLR __attribute__((section("sfrs"),address(0xBF802F64)));
extern volatile uint32_t        CNFDSET __attribute__((section("sfrs"),address(0xBF802F68)));
extern volatile uint32_t        CNFDINV __attribute__((section("sfrs"),address(0xBF802F6C)));
#define SR0D SR0D
extern volatile uint32_t   SR0D __attribute__((section("sfrs"), address(0xBF802F70)));
typedef struct {
  uint32_t w:32;
} __SR0Dbits_t;
extern volatile __SR0Dbits_t SR0Dbits __asm__ ("SR0D") __attribute__((section("sfrs"), address(0xBF802F70)));
extern volatile uint32_t        SR0DCLR __attribute__((section("sfrs"),address(0xBF802F74)));
extern volatile uint32_t        SR0DSET __attribute__((section("sfrs"),address(0xBF802F78)));
extern volatile uint32_t        SR0DINV __attribute__((section("sfrs"),address(0xBF802F7C)));
#define SR1D SR1D
extern volatile uint32_t   SR1D __attribute__((section("sfrs"), address(0xBF802F80)));
typedef struct {
  uint32_t w:32;
} __SR1Dbits_t;
extern volatile __SR1Dbits_t SR1Dbits __asm__ ("SR1D") __attribute__((section("sfrs"), address(0xBF802F80)));
extern volatile uint32_t        SR1DCLR __attribute__((section("sfrs"),address(0xBF802F84)));
extern volatile uint32_t        SR1DSET __attribute__((section("sfrs"),address(0xBF802F88)));
extern volatile uint32_t        SR1DINV __attribute__((section("sfrs"),address(0xBF802F8C)));
#define PMDCON PMDCON
extern volatile uint32_t   PMDCON __attribute__((section("sfrs"), address(0xBF8035B0)));
typedef struct {
  uint32_t :11;
  uint32_t PMDLOCK:1;
} __PMDCONbits_t;
extern volatile __PMDCONbits_t PMDCONbits __asm__ ("PMDCON") __attribute__((section("sfrs"), address(0xBF8035B0)));
extern volatile uint32_t        PMDCONCLR __attribute__((section("sfrs"),address(0xBF8035B4)));
extern volatile uint32_t        PMDCONSET __attribute__((section("sfrs"),address(0xBF8035B8)));
extern volatile uint32_t        PMDCONINV __attribute__((section("sfrs"),address(0xBF8035BC)));
#define PMD1 PMD1
extern volatile uint32_t   PMD1 __attribute__((section("sfrs"), address(0xBF8035C0)));
typedef struct {
  uint32_t ADCMD:1;
  uint32_t :11;
  uint32_t VREFMD:1;
  uint32_t :7;
  uint32_t HLVDMD:1;
} __PMD1bits_t;
extern volatile __PMD1bits_t PMD1bits __asm__ ("PMD1") __attribute__((section("sfrs"), address(0xBF8035C0)));
extern volatile uint32_t        PMD1CLR __attribute__((section("sfrs"),address(0xBF8035C4)));
extern volatile uint32_t        PMD1SET __attribute__((section("sfrs"),address(0xBF8035C8)));
extern volatile uint32_t        PMD1INV __attribute__((section("sfrs"),address(0xBF8035CC)));
#define PMD2 PMD2
extern volatile uint32_t   PMD2 __attribute__((section("sfrs"), address(0xBF8035D0)));
typedef struct {
  uint32_t CMP1MD:1;
  uint32_t CMP2MD:1;
  uint32_t CMP3MD:1;
  uint32_t :21;
  uint32_t CLC1MD:1;
  uint32_t CLC2MD:1;
  uint32_t CLC3MD:1;
  uint32_t CLC4MD:1;
} __PMD2bits_t;
extern volatile __PMD2bits_t PMD2bits __asm__ ("PMD2") __attribute__((section("sfrs"), address(0xBF8035D0)));
extern volatile uint32_t        PMD2CLR __attribute__((section("sfrs"),address(0xBF8035D4)));
extern volatile uint32_t        PMD2SET __attribute__((section("sfrs"),address(0xBF8035D8)));
extern volatile uint32_t        PMD2INV __attribute__((section("sfrs"),address(0xBF8035DC)));
#define PMD3 PMD3
extern volatile uint32_t   PMD3 __attribute__((section("sfrs"), address(0xBF8035E0)));
typedef struct {
  uint32_t :8;
  uint32_t CCP1MD:1;
  uint32_t CCP2MD:1;
  uint32_t CCP3MD:1;
  uint32_t CCP4MD:1;
  uint32_t CC5MD:1;
  uint32_t CC6MD:1;
  uint32_t CC7MD:1;
  uint32_t CC8MD:1;
  uint32_t CC9MD:1;
} __PMD3bits_t;
extern volatile __PMD3bits_t PMD3bits __asm__ ("PMD3") __attribute__((section("sfrs"), address(0xBF8035E0)));
extern volatile uint32_t        PMD3CLR __attribute__((section("sfrs"),address(0xBF8035E4)));
extern volatile uint32_t        PMD3SET __attribute__((section("sfrs"),address(0xBF8035E8)));
extern volatile uint32_t        PMD3INV __attribute__((section("sfrs"),address(0xBF8035EC)));
#define PMD4 PMD4
extern volatile uint32_t   PMD4 __attribute__((section("sfrs"), address(0xBF8035F0)));
typedef struct {
  uint32_t T1MD:1;
  uint32_t T2MD:1;
  uint32_t T3MD:1;
} __PMD4bits_t;
extern volatile __PMD4bits_t PMD4bits __asm__ ("PMD4") __attribute__((section("sfrs"), address(0xBF8035F0)));
extern volatile uint32_t        PMD4CLR __attribute__((section("sfrs"),address(0xBF8035F4)));
extern volatile uint32_t        PMD4SET __attribute__((section("sfrs"),address(0xBF8035F8)));
extern volatile uint32_t        PMD4INV __attribute__((section("sfrs"),address(0xBF8035FC)));
#define PMD5 PMD5
extern volatile uint32_t   PMD5 __attribute__((section("sfrs"), address(0xBF803600)));
typedef struct {
  uint32_t U1MD:1;
  uint32_t U2MD:1;
  uint32_t U3MD:1;
  uint32_t :5;
  uint32_t SPI1MD:1;
  uint32_t SPI2MD:1;
  uint32_t SPI3MD:1;
  uint32_t :5;
  uint32_t I2C1MD:1;
  uint32_t I2C2MD:1;
  uint32_t I2C3MD:1;
  uint32_t :5;
  uint32_t USBMD:1;
} __PMD5bits_t;
extern volatile __PMD5bits_t PMD5bits __asm__ ("PMD5") __attribute__((section("sfrs"), address(0xBF803600)));
extern volatile uint32_t        PMD5CLR __attribute__((section("sfrs"),address(0xBF803604)));
extern volatile uint32_t        PMD5SET __attribute__((section("sfrs"),address(0xBF803608)));
extern volatile uint32_t        PMD5INV __attribute__((section("sfrs"),address(0xBF80360C)));
#define PMD6 PMD6
extern volatile uint32_t   PMD6 __attribute__((section("sfrs"), address(0xBF803610)));
typedef struct {
  uint32_t RTCCMD:1;
  uint32_t :7;
  uint32_t REFOMD:1;
} __PMD6bits_t;
extern volatile __PMD6bits_t PMD6bits __asm__ ("PMD6") __attribute__((section("sfrs"), address(0xBF803610)));
extern volatile uint32_t        PMD6CLR __attribute__((section("sfrs"),address(0xBF803614)));
extern volatile uint32_t        PMD6SET __attribute__((section("sfrs"),address(0xBF803618)));
extern volatile uint32_t        PMD6INV __attribute__((section("sfrs"),address(0xBF80361C)));
#define PMD7 PMD7
extern volatile uint32_t   PMD7 __attribute__((section("sfrs"), address(0xBF803620)));
typedef struct {
  uint32_t :4;
  uint32_t DMAMD:1;
} __PMD7bits_t;
