Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm048.h
#define _AD1CON5_LPEN_POSITION                   0x0000000E
#define _AD1CON5_LPEN_MASK                       0x00004000
#define _AD1CON5_LPEN_LENGTH                     0x00000001

#define _AD1CON5_ASEN_POSITION                   0x0000000F
#define _AD1CON5_ASEN_MASK                       0x00008000
#define _AD1CON5_ASEN_LENGTH                     0x00000001

#define _AD1CHIT_CHH0_POSITION                   0x00000000
#define _AD1CHIT_CHH0_MASK                       0x00000001
#define _AD1CHIT_CHH0_LENGTH                     0x00000001

#define _AD1CHIT_CHH1_POSITION                   0x00000001
#define _AD1CHIT_CHH1_MASK                       0x00000002
#define _AD1CHIT_CHH1_LENGTH                     0x00000001

#define _AD1CHIT_CHH2_POSITION                   0x00000002
#define _AD1CHIT_CHH2_MASK                       0x00000004
#define _AD1CHIT_CHH2_LENGTH                     0x00000001

#define _AD1CHIT_CHH3_POSITION                   0x00000003
#define _AD1CHIT_CHH3_MASK                       0x00000008
#define _AD1CHIT_CHH3_LENGTH                     0x00000001

#define _AD1CHIT_CHH4_POSITION                   0x00000004
#define _AD1CHIT_CHH4_MASK                       0x00000010
#define _AD1CHIT_CHH4_LENGTH                     0x00000001

#define _AD1CHIT_CHH5_POSITION                   0x00000005
#define _AD1CHIT_CHH5_MASK                       0x00000020
#define _AD1CHIT_CHH5_LENGTH                     0x00000001

#define _AD1CHIT_CHH6_POSITION                   0x00000006
#define _AD1CHIT_CHH6_MASK                       0x00000040
#define _AD1CHIT_CHH6_LENGTH                     0x00000001

#define _AD1CHIT_CHH7_POSITION                   0x00000007
#define _AD1CHIT_CHH7_MASK                       0x00000080
#define _AD1CHIT_CHH7_LENGTH                     0x00000001

#define _AD1CHIT_CHH8_POSITION                   0x00000008
#define _AD1CHIT_CHH8_MASK                       0x00000100
#define _AD1CHIT_CHH8_LENGTH                     0x00000001

#define _AD1CHIT_CHH9_POSITION                   0x00000009
#define _AD1CHIT_CHH9_MASK                       0x00000200
#define _AD1CHIT_CHH9_LENGTH                     0x00000001

#define _AD1CHIT_CHH10_POSITION                  0x0000000A
#define _AD1CHIT_CHH10_MASK                      0x00000400
#define _AD1CHIT_CHH10_LENGTH                    0x00000001

#define _AD1CHIT_CHH11_POSITION                  0x0000000B
#define _AD1CHIT_CHH11_MASK                      0x00000800
#define _AD1CHIT_CHH11_LENGTH                    0x00000001

#define _AD1CHIT_CHH12_POSITION                  0x0000000C
#define _AD1CHIT_CHH12_MASK                      0x00001000
#define _AD1CHIT_CHH12_LENGTH                    0x00000001

#define _AD1CHIT_CHH13_POSITION                  0x0000000D
#define _AD1CHIT_CHH13_MASK                      0x00002000
#define _AD1CHIT_CHH13_LENGTH                    0x00000001

#define _AD1CHIT_CHH14_POSITION                  0x0000000E
#define _AD1CHIT_CHH14_MASK                      0x00004000
#define _AD1CHIT_CHH14_LENGTH                    0x00000001

#define _AD1CHIT_CHH15_POSITION                  0x0000000F
#define _AD1CHIT_CHH15_MASK                      0x00008000
#define _AD1CHIT_CHH15_LENGTH                    0x00000001

#define _AD1CHIT_CHH16_POSITION                  0x00000010
#define _AD1CHIT_CHH16_MASK                      0x00010000
#define _AD1CHIT_CHH16_LENGTH                    0x00000001

#define _AD1CHIT_CHH17_POSITION                  0x00000011
#define _AD1CHIT_CHH17_MASK                      0x00020000
#define _AD1CHIT_CHH17_LENGTH                    0x00000001

#define _AD1CHIT_CHH18_POSITION                  0x00000012
#define _AD1CHIT_CHH18_MASK                      0x00040000
#define _AD1CHIT_CHH18_LENGTH                    0x00000001

#define _AD1CHIT_CHH19_POSITION                  0x00000013
#define _AD1CHIT_CHH19_MASK                      0x00080000
#define _AD1CHIT_CHH19_LENGTH                    0x00000001

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_CVREFSEL_POSITION                0x00000008
#define _CMSTAT_CVREFSEL_MASK                    0x00000100
#define _CMSTAT_CVREFSEL_LENGTH                  0x00000001

#define _CMSTAT_SIDL_POSITION                    0x0000000D
#define _CMSTAT_SIDL_MASK                        0x00002000
#define _CMSTAT_SIDL_LENGTH                      0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000010
#define _CMSTAT_C1EVT_MASK                       0x00010000
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000011
#define _CMSTAT_C2EVT_MASK                       0x00020000
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x00000012
#define _CMSTAT_C3EVT_MASK                       0x00040000
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CEVT_POSITION                    0x00000009
#define _CM1CON_CEVT_MASK                        0x00000200
#define _CM1CON_CEVT_LENGTH                      0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_ON_POSITION                      0x0000000F
#define _CM1CON_ON_MASK                          0x00008000
#define _CM1CON_ON_LENGTH                        0x00000001

#define _CM2CON_CCH_POSITION                     0x00000000
#define _CM2CON_CCH_MASK                         0x00000003
#define _CM2CON_CCH_LENGTH                       0x00000002

#define _CM2CON_CREF_POSITION                    0x00000004
#define _CM2CON_CREF_MASK                        0x00000010
#define _CM2CON_CREF_LENGTH                      0x00000001

#define _CM2CON_EVPOL_POSITION                   0x00000006
#define _CM2CON_EVPOL_MASK                       0x000000C0
#define _CM2CON_EVPOL_LENGTH                     0x00000002

#define _CM2CON_COUT_POSITION                    0x00000008
#define _CM2CON_COUT_MASK                        0x00000100
#define _CM2CON_COUT_LENGTH                      0x00000001

#define _CM2CON_CEVT_POSITION                    0x00000009
#define _CM2CON_CEVT_MASK                        0x00000200
#define _CM2CON_CEVT_LENGTH                      0x00000001

#define _CM2CON_CPOL_POSITION                    0x0000000D
#define _CM2CON_CPOL_MASK                        0x00002000
#define _CM2CON_CPOL_LENGTH                      0x00000001

#define _CM2CON_COE_POSITION                     0x0000000E
#define _CM2CON_COE_MASK                         0x00004000
#define _CM2CON_COE_LENGTH                       0x00000001

#define _CM2CON_ON_POSITION                      0x0000000F
#define _CM2CON_ON_MASK                          0x00008000
#define _CM2CON_ON_LENGTH                        0x00000001

#define _CM3CON_CCH_POSITION                     0x00000000
#define _CM3CON_CCH_MASK                         0x00000003
#define _CM3CON_CCH_LENGTH                       0x00000002

#define _CM3CON_CREF_POSITION                    0x00000004
#define _CM3CON_CREF_MASK                        0x00000010
#define _CM3CON_CREF_LENGTH                      0x00000001

#define _CM3CON_EVPOL_POSITION                   0x00000006
#define _CM3CON_EVPOL_MASK                       0x000000C0
#define _CM3CON_EVPOL_LENGTH                     0x00000002

#define _CM3CON_COUT_POSITION                    0x00000008
#define _CM3CON_COUT_MASK                        0x00000100
#define _CM3CON_COUT_LENGTH                      0x00000001

#define _CM3CON_CEVT_POSITION                    0x00000009
#define _CM3CON_CEVT_MASK                        0x00000200
#define _CM3CON_CEVT_LENGTH                      0x00000001

#define _CM3CON_CPOL_POSITION                    0x0000000D
#define _CM3CON_CPOL_MASK                        0x00002000
#define _CM3CON_CPOL_LENGTH                      0x00000001

#define _CM3CON_COE_POSITION                     0x0000000E
#define _CM3CON_COE_MASK                         0x00004000
#define _CM3CON_COE_LENGTH                       0x00000001

#define _CM3CON_ON_POSITION                      0x0000000F
#define _CM3CON_ON_MASK                          0x00008000
#define _CM3CON_ON_LENGTH                        0x00000001

