Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm048.h
#define _CNEN0A_CNIE0A2_POSITION                 0x00000002
#define _CNEN0A_CNIE0A2_MASK                     0x00000004
#define _CNEN0A_CNIE0A2_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A3_POSITION                 0x00000003
#define _CNEN0A_CNIE0A3_MASK                     0x00000008
#define _CNEN0A_CNIE0A3_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A4_POSITION                 0x00000004
#define _CNEN0A_CNIE0A4_MASK                     0x00000010
#define _CNEN0A_CNIE0A4_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A5_POSITION                 0x00000005
#define _CNEN0A_CNIE0A5_MASK                     0x00000020
#define _CNEN0A_CNIE0A5_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A6_POSITION                 0x00000006
#define _CNEN0A_CNIE0A6_MASK                     0x00000040
#define _CNEN0A_CNIE0A6_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A7_POSITION                 0x00000007
#define _CNEN0A_CNIE0A7_MASK                     0x00000080
#define _CNEN0A_CNIE0A7_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A8_POSITION                 0x00000008
#define _CNEN0A_CNIE0A8_MASK                     0x00000100
#define _CNEN0A_CNIE0A8_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A9_POSITION                 0x00000009
#define _CNEN0A_CNIE0A9_MASK                     0x00000200
#define _CNEN0A_CNIE0A9_LENGTH                   0x00000001

#define _CNEN0A_CNIE0A10_POSITION                0x0000000A
#define _CNEN0A_CNIE0A10_MASK                    0x00000400
#define _CNEN0A_CNIE0A10_LENGTH                  0x00000001

#define _CNEN0A_CNIE0A15_POSITION                0x0000000F
#define _CNEN0A_CNIE0A15_MASK                    0x00008000
#define _CNEN0A_CNIE0A15_LENGTH                  0x00000001

#define _CNEN0A_w_POSITION                       0x00000000
#define _CNEN0A_w_MASK                           0xFFFFFFFF
#define _CNEN0A_w_LENGTH                         0x00000020

#define _CNSTATA_CNSTATA0_POSITION               0x00000000
#define _CNSTATA_CNSTATA0_MASK                   0x00000001
#define _CNSTATA_CNSTATA0_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA1_POSITION               0x00000001
#define _CNSTATA_CNSTATA1_MASK                   0x00000002
#define _CNSTATA_CNSTATA1_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA2_POSITION               0x00000002
#define _CNSTATA_CNSTATA2_MASK                   0x00000004
#define _CNSTATA_CNSTATA2_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA3_POSITION               0x00000003
#define _CNSTATA_CNSTATA3_MASK                   0x00000008
#define _CNSTATA_CNSTATA3_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA4_POSITION               0x00000004
#define _CNSTATA_CNSTATA4_MASK                   0x00000010
#define _CNSTATA_CNSTATA4_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA5_POSITION               0x00000005
#define _CNSTATA_CNSTATA5_MASK                   0x00000020
#define _CNSTATA_CNSTATA5_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA6_POSITION               0x00000006
#define _CNSTATA_CNSTATA6_MASK                   0x00000040
#define _CNSTATA_CNSTATA6_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA7_POSITION               0x00000007
#define _CNSTATA_CNSTATA7_MASK                   0x00000080
#define _CNSTATA_CNSTATA7_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA8_POSITION               0x00000008
#define _CNSTATA_CNSTATA8_MASK                   0x00000100
#define _CNSTATA_CNSTATA8_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA9_POSITION               0x00000009
#define _CNSTATA_CNSTATA9_MASK                   0x00000200
#define _CNSTATA_CNSTATA9_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA10_POSITION              0x0000000A
#define _CNSTATA_CNSTATA10_MASK                  0x00000400
#define _CNSTATA_CNSTATA10_LENGTH                0x00000001

#define _CNSTATA_CNSTATA15_POSITION              0x0000000F
#define _CNSTATA_CNSTATA15_MASK                  0x00008000
#define _CNSTATA_CNSTATA15_LENGTH                0x00000001

#define _CNSTATA_w_POSITION                      0x00000000
#define _CNSTATA_w_MASK                          0xFFFFFFFF
#define _CNSTATA_w_LENGTH                        0x00000020

#define _CNEN1A_CNIE1A0_POSITION                 0x00000000
#define _CNEN1A_CNIE1A0_MASK                     0x00000001
#define _CNEN1A_CNIE1A0_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A1_POSITION                 0x00000001
#define _CNEN1A_CNIE1A1_MASK                     0x00000002
#define _CNEN1A_CNIE1A1_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A2_POSITION                 0x00000002
#define _CNEN1A_CNIE1A2_MASK                     0x00000004
#define _CNEN1A_CNIE1A2_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A3_POSITION                 0x00000003
#define _CNEN1A_CNIE1A3_MASK                     0x00000008
#define _CNEN1A_CNIE1A3_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A4_POSITION                 0x00000004
#define _CNEN1A_CNIE1A4_MASK                     0x00000010
#define _CNEN1A_CNIE1A4_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A5_POSITION                 0x00000005
#define _CNEN1A_CNIE1A5_MASK                     0x00000020
#define _CNEN1A_CNIE1A5_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A6_POSITION                 0x00000006
#define _CNEN1A_CNIE1A6_MASK                     0x00000040
#define _CNEN1A_CNIE1A6_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A7_POSITION                 0x00000007
#define _CNEN1A_CNIE1A7_MASK                     0x00000080
#define _CNEN1A_CNIE1A7_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A8_POSITION                 0x00000008
#define _CNEN1A_CNIE1A8_MASK                     0x00000100
#define _CNEN1A_CNIE1A8_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A9_POSITION                 0x00000009
#define _CNEN1A_CNIE1A9_MASK                     0x00000200
#define _CNEN1A_CNIE1A9_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A10_POSITION                0x0000000A
#define _CNEN1A_CNIE1A10_MASK                    0x00000400
#define _CNEN1A_CNIE1A10_LENGTH                  0x00000001

