Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm048.h
#define _INTCON_TPC_POSITION                     0x00000008
#define _INTCON_TPC_MASK                         0x00000700
#define _INTCON_TPC_LENGTH                       0x00000003

#define _INTCON_MVEC_POSITION                    0x0000000C
#define _INTCON_MVEC_MASK                        0x00001000
#define _INTCON_MVEC_LENGTH                      0x00000001

#define _INTCON_VS_POSITION                      0x00000010
#define _INTCON_VS_MASK                          0x007F0000
#define _INTCON_VS_LENGTH                        0x00000007

#define _PRISS_SEVCSS_POSITION                   0x00000000
#define _PRISS_SEVCSS_MASK                       0x00000001
#define _PRISS_SEVCSS_LENGTH                     0x00000001

#define _PRISS_PRI1SS_POSITION                   0x00000004
#define _PRISS_PRI1SS_MASK                       0x00000010
#define _PRISS_PRI1SS_LENGTH                     0x00000001

#define _PRISS_PRI2SS_POSITION                   0x00000008
#define _PRISS_PRI2SS_MASK                       0x00000100
#define _PRISS_PRI2SS_LENGTH                     0x00000001

#define _PRISS_PRI3SS_POSITION                   0x0000000C
#define _PRISS_PRI3SS_MASK                       0x00001000
#define _PRISS_PRI3SS_LENGTH                     0x00000001

#define _PRISS_PRI4SS_POSITION                   0x00000010
#define _PRISS_PRI4SS_MASK                       0x00010000
#define _PRISS_PRI4SS_LENGTH                     0x00000001

#define _PRISS_PRI5SS_POSITION                   0x00000014
#define _PRISS_PRI5SS_MASK                       0x00100000
#define _PRISS_PRI5SS_LENGTH                     0x00000001

#define _PRISS_PRI6SS_POSITION                   0x00000018
#define _PRISS_PRI6SS_MASK                       0x01000000
#define _PRISS_PRI6SS_LENGTH                     0x00000001

#define _PRISS_PRI7SS_POSITION                   0x0000001C
#define _PRISS_PRI7SS_MASK                       0x10000000
#define _PRISS_PRI7SS_LENGTH                     0x00000001

#define _INTSTAT_SIRQ_POSITION                   0x00000000
#define _INTSTAT_SIRQ_MASK                       0x000000FF
#define _INTSTAT_SIRQ_LENGTH                     0x00000008

#define _INTSTAT_SRIPL_POSITION                  0x00000008
#define _INTSTAT_SRIPL_MASK                      0x00000700
#define _INTSTAT_SRIPL_LENGTH                    0x00000003

#define _IPTMR_IPTMR_POSITION                    0x00000000
#define _IPTMR_IPTMR_MASK                        0xFFFFFFFF
#define _IPTMR_IPTMR_LENGTH                      0x00000020

#define _IFS0_CTIF_POSITION                      0x00000000
#define _IFS0_CTIF_MASK                          0x00000001
#define _IFS0_CTIF_LENGTH                        0x00000001

#define _IFS0_CS0IF_POSITION                     0x00000001
#define _IFS0_CS0IF_MASK                         0x00000002
#define _IFS0_CS0IF_LENGTH                       0x00000001

#define _IFS0_CS1IF_POSITION                     0x00000002
#define _IFS0_CS1IF_MASK                         0x00000004
#define _IFS0_CS1IF_LENGTH                       0x00000001

#define _IFS0_INT0IF_POSITION                    0x00000003
#define _IFS0_INT0IF_MASK                        0x00000008
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_INT1IF_POSITION                    0x00000004
#define _IFS0_INT1IF_MASK                        0x00000010
#define _IFS0_INT1IF_LENGTH                      0x00000001

#define _IFS0_INT2IF_POSITION                    0x00000005
#define _IFS0_INT2IF_MASK                        0x00000020
#define _IFS0_INT2IF_LENGTH                      0x00000001

#define _IFS0_INT3IF_POSITION                    0x00000006
#define _IFS0_INT3IF_MASK                        0x00000040
#define _IFS0_INT3IF_LENGTH                      0x00000001

#define _IFS0_INT4IF_POSITION                    0x00000007
#define _IFS0_INT4IF_MASK                        0x00000080
#define _IFS0_INT4IF_LENGTH                      0x00000001

#define _IFS0_CNAIF_POSITION                     0x00000008
#define _IFS0_CNAIF_MASK                         0x00000100
#define _IFS0_CNAIF_LENGTH                       0x00000001

#define _IFS0_CNBIF_POSITION                     0x00000009
#define _IFS0_CNBIF_MASK                         0x00000200
#define _IFS0_CNBIF_LENGTH                       0x00000001

#define _IFS0_CNCIF_POSITION                     0x0000000A
#define _IFS0_CNCIF_MASK                         0x00000400
#define _IFS0_CNCIF_LENGTH                       0x00000001

#define _IFS0_CNDIF_POSITION                     0x0000000B
#define _IFS0_CNDIF_MASK                         0x00000800
#define _IFS0_CNDIF_LENGTH                       0x00000001

#define _IFS0_T1IF_POSITION                      0x00000011
#define _IFS0_T1IF_MASK                          0x00020000
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_T2IF_POSITION                      0x00000012
#define _IFS0_T2IF_MASK                          0x00040000
#define _IFS0_T2IF_LENGTH                        0x00000001

#define _IFS0_T3IF_POSITION                      0x00000013
#define _IFS0_T3IF_MASK                          0x00080000
#define _IFS0_T3IF_LENGTH                        0x00000001

#define _IFS0_CMP1IF_POSITION                    0x00000017
#define _IFS0_CMP1IF_MASK                        0x00800000
#define _IFS0_CMP1IF_LENGTH                      0x00000001

#define _IFS0_CMP2IF_POSITION                    0x00000018
#define _IFS0_CMP2IF_MASK                        0x01000000
#define _IFS0_CMP2IF_LENGTH                      0x00000001

#define _IFS0_CMP3IF_POSITION                    0x00000019
#define _IFS0_CMP3IF_MASK                        0x02000000
#define _IFS0_CMP3IF_LENGTH                      0x00000001

#define _IFS0_USBIF_POSITION                     0x0000001D
#define _IFS0_USBIF_MASK                         0x20000000
#define _IFS0_USBIF_LENGTH                       0x00000001

#define _IFS1_RTCCIF_POSITION                    0x00000000
#define _IFS1_RTCCIF_MASK                        0x00000001
#define _IFS1_RTCCIF_LENGTH                      0x00000001

#define _IFS1_AD1IF_POSITION                     0x00000001
#define _IFS1_AD1IF_MASK                         0x00000002
#define _IFS1_AD1IF_LENGTH                       0x00000001

